Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Hydraulische Heberampen
en: Hydraulic lifting ramps

source: Hydraulikschrauber für Bohranlagen
en: Hydraulic wrenches for use on drilling rigs

source: Hydraulisch betätigte Drosselklappenventile
en: Hydraulically operated butterfly valves

source: Handquirle als elektrische Geräte
en: Beaters being electric appliances

source: Antriebe für Luftklappen
en: Drives for ventilation flaps

source: Antriebsvorrichtungen für Maschinen
en: Driving devices for machines

source: Kickstarter für Motorfahrräder
en: Kick starters for motorcycles

source: Maschinen für die Textilindustrie
en: Machines for the textile industry

source: Drehbürsten für Maschinen
en: Rotary brushes for machines

source: Geschirrspülmaschinen für den Haushalt
en: Dish washing machines for household purposes

source: Wärmeaustauscher [Maschinenteile]
en: Heat exchangers [parts of machines]

source: Düngemittelstreuer [traktorgezogene landwirtschaftliche Geräte]
en: Fertilizer distributors [tractor towed agricultural implements]

source: Heuballenpressen [traktorgezogene landwirtschaftliche Geräte]
en: Hay balers [tractor towed agricultural implements]

source: Heurechen [traktorgezogene landwirtschaftliche Geräte]
en: Hay rakes [tractor towed agricultural implements]

source: Walzen [traktorgezogene landwirtschaftliche Geräte]
en: Rollers [tractor towed agricultural implements]

source: Abfallentsorgungsmaschinen für den Haushalt
en: Waste disposal machines for household use

source: Wasserpumpen zum Belüften von Aquarien
en: Water pumps for aerating aquaria

source: Wasserabscheider [Maschinen]
en: Water separators [machines]

source: Pendelschutzbremsen für Krangabeln
en: Anti-swinging brakes for crane forks

source: Scheibenbremsen als Maschinenteile
en: Disc brakes being parts of machines

source: Scheibenförmige rotierende Schleifwerkzeuge [Maschinenteile]
en: Disc shaped rotating grinding tools [parts for machines]

source: Thermostatische Steuerventile für Maschinen
en: Thermostatic control valves for machines

source: Richtmaschinen für Karosserien
en: Body straighteners [machines]

source: Schläuche [nicht aus Metall] für Hydrauliksysteme in Maschinen
en: Hoses (Non-metallic -) for use in hydraulic systems in machines

source: Nadelwalzen [Maschinen]
en: Spiked rollers [machines]

source: Schuhleisten [Maschinenteile]
en: Lasts for shoes [parts of machines]

source: Selbstansaugende Kreiselpumpen
en: Self-priming centrifugal pumps

source: Walzmaschinen zur Walzung von Metallen
en: Rolling machines for rolling metals

source: Drehstromlichtmaschinen für Wasserfahrzeuge
en: Electric alternators for water vehicles

source: Anlasserkupplungen für Maschinen
en: Starting couplings for machines

source: Drehmomentschlüssel [Maschinen]
en: Torque wrenches [machines]

source: Verarbeitungsmaschinen für die Lebensmittelindustrie
en: Processing machines for use in the food industry

source: Unterdruckventile [Maschinenteile]
en: Vacuum control valves [parts of machines]

source: Hydraulisch gesteuerte automatische Ventile
en: Valves operated automatically by hydraulic control

source: Bohrmaschinen [Maschinenteile]
en: Drill presses being machines

source: Elektrische Brotmesser
en: Bread knives (Electric -)

source: Formen zum Schmieden von Metallerzeugnissen [Maschinenteile]
en: Moulds for forging metal products [parts of machines]

source: Elektrische Spritzgeräte zum Tragen auf dem Rücken
en: Sprayers (knapsack -) [electric] for carrying on the back

source: Elektrische Motoranlasser
en: Electronic starters for engines

source: Kontrollgeräte für die Garnspannung [Maschinenteile]
en: Yarn tension control devices [parts of machines]

source: Strickmaschinen mit Jacquard-Steuerung
en: Jacquard controlled knitting machines

source: Kupplungen für Klauenwellen [ausgenommen für Landfahrzeuge]
en: Jaw type shaft couplings other than for land vehicles

source: Vierkantkeile [Maschinenteile]
en: Splines (square -) [parts of machines]

source: Spritzschutzvorrichtungen für Maschinen
en: Spray prevention guards for machines

source: Steinhämmer [Maschinen]
en: Stone hammers [machines]

source: Steuerriemenspanner für Landfahrzeugmotoren
en: Timing belt tensioners for land vehicle engines

source: Elektrische Mehrzweckhandschraubendreher
en: Multiple function hand-held screwdrivers (Electric -)

source: Schussfadenrichter [Maschinen]
en: Weft straighteners [machines]

source: Antriebsscheiben für Treibriemen von landwirtschaftlichen Maschinen
en: Drive pulleys for power transmission belts of agricultural machines

source: Übersetzungsgetriebe, ausgenommen für Landfahrzeuge
en: Drive transmissions, other than for land vehicles

source: Unbemannte Reinigungsfahrzeuge
en: Pilotless cleaning vehicles

source: Bohrmaschinen für Leiterplatten
en: Printed circuit board drilling machines

source: Entlüfter in Form von Luftabsaugern
en: Exhausters being suction ventilators

source: Gewerbliche Reinigungsmaschinen
en: Industrial cleaning machines

source: Rollenanlagen für die Bremsprüfung
en: Roller installations for brake testing

source: Werkzeuge zum Ausrichten von Bohrern [Maschinenteile]
en: Drill aligning instruments for use with machines

source: Lochstreifenlesegeräte für Stickereimaschinen
en: Tape readers for use with embroidery machines

source: Zerkleinerungsmaschinen für Holz
en: Size reduction machines for wood

source: Hülsenartige Linearkugellager für lineare Bewegungen
en: Sleeve type linear ball bearings for use in linear movement

source: Schlammventile als Maschinenteile
en: Sludge valves being parts of machines

source: Förderapparate für Gruben
en: Haulage apparatus [mining]

source: Geräte zum Sieben von Erde [Maschinen]
en: Soil screening apparatus [machines]

source: Knetmaschinen für chemische Verfahren
en: Kneading machines [for chemical processing]

source: Stapelmaschinen [ausgenommen Gabelstapler]
en: Stacking machines [other than fork-lift trucks]

source: Falzhobel [Maschinen]
en: Rabetting planes [machines]

source: Anbauteile [Maschinenteile] zum Einspannen von Werkstücken
en: Workpiece clamping attachments [parts of machines]

source: Landwirtschaftliche Maschinen für die Bodenbearbeitung
en: Agricultural machines for ground cultivation

source: Wechselstrom-Servomotoren
en: Alternating current servo motors

source: Elektrische Rasenbelüfter
en: Power-operated lawn aerators

source: Elektrische Rasenkantenschneider
en: Power-operated lawn edgers

source: Elektrische Rohrreinigungsspiralen
en: Power-operated plumbing snakes

source: Elektrische Teppichreinigungsmaschinen [Schamponieren]
en: Electrical carpet cleaning [shampooing] machines

source: Reinigungsmaschinen für Textilien
en: Scouring machines for textiles

source: Roboter für den Materialumschlag
en: Robotic apparatus for handling materials

source: Bolzenschneider [Maschinen]
en: Bolt cutters [machines]

source: Düsen als Teile von motorbetriebenen Sprühgeräten
en: Nozzles which are parts of power-operated sprayers

source: Maschinen zum Schneiden von Bandmaterial
en: Strip material (Machines for cutting -)

source: Kupplungen und Vorrichtungen zur Kraftübertragung [ausgenommen für Landfahrzeuge]
en: Machine coupling and transmission components (except for land vehicles)

source: Elektrische Aufzugantriebe
en: Electric drives for elevators

source: Kraftbetriebene Schärfgeräte
en: Power operated sharpeners

source: Numerisch gesteuerte Modelliermaschinen für gewerbliche Zwecke
en: Numerically controlled modelling machines for business use

source: Riemenscheiben [Motorenteile]
en: Pulleys [parts of motors]

source: Schablonen für Schablonenschneidmaschinen [ausgenommen für Bürozwecke]
en: Stencils for use with stencil cutting machines [other than for office use]

source: Buchsen als Teile von Maschinen
en: Bushings being parts of machines

source: Walzengetriebe [ausgenommen für Landfahrzeuge]
en: Rolling gearings [other than for land vehicles]

source: Ausgabemaschinen [ausgenommen Verkaufsautomaten]
en: Dispensing machines [other than vending machines]

source: Anlagen für den Schüttgutumschlag von körnigem Material
en: Installations for the bulk handling of granular materials

source: Schleifwerkzeuge [Maschinen oder Maschinenteile]
en: Grinding tools [machines or parts of machines]

source: Außenbordmotoren für Boote
en: Outboard engines for boats

source: Gewerbliche Bodenreinigungsmaschinen zum Polieren
en: Industrial floor cleaning [polishing] machines

source: Motoren für die Luft- und Raumfahrt
en: Motors for aeronautical purposes

source: Maschinen zur Herstellung von Formen
en: Machines for the manufacture of moulds

source: Elektrische Staubsauger
en: Electric vacuum cleaners

source: Röhrenförmige Schweißelektroden
en: Tubular welding electrodes [electric]

source: Druckleitungen aus Metall [Maschinenteile]
en: Pressure pipes of metal [parts of machines]

source: Ackerfräsen [Maschinen] zum Anhängen an Fahrzeuge
en: Tillers [machines] for towing behind vehicles

source: Rotierende Metallschneidwerkzeuge [Maschinenteile]
en: Rotary metal cutting tools [parts of machines]

source: Drehdüsen für wasserbetriebene Hochdruckreinigungsmaschinen
en: Rotary nozzles for use with high pressure water washing machines

source: Gasfilter [Maschinenteile]
en: Filters for gases [machines]

source: Filter für Verbrennungsmotoren
en: Filters for internal combustion engines

source: Abnutzungsteile für Zerkleinerer
en: Wear segments for crushers

source: Mechanische und hydraulische Aufzüge
en: Mechanical and hydraulic lifts

source: Gaserzeuger [Kompressoren] zum Aufblasen flexibler Bauwerke
en: Gas generators [compressors] for inflating flexible structures

source: Sprühgeräte [Maschinen]
en: Pedestal drilling machines

source: Gebläse für gewerbliche Zwecke
en: Implements [machines] for spraying

source: Geräte zum Bewegen von Erde [Maschinen]
en: Soil engaging parts for agricultural implements

source: Elektrische Hackmesser für Haushaltszwecke
en: Mincers [electric] for household use

source: Bergbauschaufeln [Maschinen]
en: Mining shovels [machines]

source: Dichtungen aus Metall für Rohre [Teile von Maschinen]
en: Joints for pipes (metal -) [parts of machines]

source: Poliermaschinen für Messer
en: Knife polishing machines

source: Bürsten als Teile von Motoren, Generatoren und Dynamos
en: Brushes being parts of motors, generators and dynamos

source: Generatoren für die Notstromversorgung
en: Emergency power supply generators

source: Motoren zur Erzeugung von Elektrizität
en: Engines for the generation of electricity

source: Mechanische Pressen [zur Metallbearbeitung]
en: Mechanical presses [for metalworking]

source: Fahrbare Dockkräne
en: Mobile dock cranes

source: Graphische Epoxidbohrer [Maschinen oder als Teil von Maschinen]
en: Graphic epoxy drills [machines or parts for machines]

source: Verbrennungsmotoren für Industriemaschinen
en: Combustion engines for industrial machines

source: Verbrennungsmotoren für Wasserfahrzeuge
en: Combustion engines for water vessels

source: Abgasturbolader für Landfahrzeugmotoren
en: Turbo-superchargers for land vehicle engines

source: Beläge für Bremsen [Maschinenteile]
en: Linings for brakes [parts of machines]

source: Ladegeräte [Förderer]
en: Loaders [conveyors]

source: Freilaufkupplungen [ausgenommen für Landfahrzeuge]
en: Free wheel couplings [other than for land vehicles]

source: Nicht handbetriebene Pfeffermühlen
en: Pepper mills, other than hand-operated

source: Zentrifugalseparatoren für gewerbliche Zwecke
en: Centrifuge separators for industrial use

source: Keramikmassen als Motorenteile
en: Ceramic masses being parts of motors

source: Keramikspitzen [Werkzeuge für Maschinen]
en: Ceramic tips [tools for machines]

source: Keramikwerkzeuge für Maschinen
en: Ceramic tools for machines

source: Schneidschuhe [Maschinenteile]
en: Cutting shoes [parts of machines]

source: Schneidwerkzeuge [Maschinen] in Form von Bohreinsätzen
en: Cutting tools [machine] in the form of drill bits

source: Drahtziehmaschinen für gewerbliche Zwecke
en: Manipulating devices [machines] for industrial use

source: Gasbetriebene Lötlampen
en: Gas-operated blow torches

source: Futtermischmaschinen [Futtermischer]
en: Fodder mixing machines [feed mixers]

source: Kugelringe für Maschinen
en: Ball rings for machines

source: Winden für den Fischfang [Maschinen]
en: Net hauling machines [fishing]

source: Greifer für Heu [Maschinen oder Maschinenteile]
en: Hay grippers [machines or parts of machines]

source: Wärmeisolierte Metallrohrelemente [Maschinenteile]
en: Heat insulated metal piping elements [parts of machines]

source: Elektrische Schweißrobotermaschinen
en: Robotic electrical welding apparatus

source: Automatische Ladegeräte für Diffusionsöfen
en: Robotic loaders for diffusion furnaces

source: Raketenmotorantriebe für Luftfahrzeuge
en: Rocket motor propulsion apparatus for aircraft

source: Abisoliermaschinen zum Entfernen der Ummantelung von Elektrokabel
en: Wire stripping machines for removing the covering from electric cables

source: Elektrische Holzscheren
en: Wood scissors (Electric -)

source: Schleifscheiben für Maschinen
en: Sanding disks for use with machines

source: Sägeblätter für Elektrowerkzeuge
en: Saw blades for use with power tools

source: Filtergehäuse als Teile von Motoren
en: Filter housings being parts of engines

source: Gasturbinentriebwerke für Wasserfahrzeuge
en: Gas turbine engines for sea vehicles

source: Getriebebaugruppen [ausgenommen für Landfahrzeuge]
en: Gear assemblies, other than for land vehicles

source: Dampfturbinen, ausgenommen für Landfahrzeuge
en: Steam turbines [other than for land vehicles]

source: Verteilerkappen [Teile von Verbrennungsmotoren]
en: Distributor caps [internal combustion engine parts]

source: Pleuelstangen [Teile von Verbrennungsmotoren]
en: Connecting rods [internal combustion engine parts]

source: Aktenvernichter [Maschinen], ausgenommen für Bürozwecke
en: Paper shredders [machines], other than for office use

source: Rasenmäher [Maschinen]
en: Lawnmowers [machines]

source: Spannvorrichtungen für Werkzeugmaschinen
en: Clamping devices for use with machine tools

source: Unbeheizte Trockenschleudern
en: Spin driers [not heated]

source: Kupplungen zur Kraftübertragung für Meeresfahrzeuge
en: Power transmission couplings for sea craft

source: Bagger [Erdbewegungsmaschinen]
en: Excavators [earth moving machines]

source: Kompressoren zur Rückgewinnung und Wiederverwendung von Kühlgasen
en: Compressors for recovering and recycling refrigerant gases

source: Wasserpumpen für Motoren und Maschinen
en: Water pumps for use in motors and engines

source: Elektrische Schärfmaschinen für Messerschmiedewaren
en: Sharpening machines for cutlery (Electric -)

source: Drescher [landwirtschaftliche Maschinen]
en: Threshers [agricultural implements]

source: Reihenleger [landwirtschaftliche Maschinen]
en: Windrowers [agricultural implements]

source: Fänger für Staub [Teile von Maschinen]
en: Traps for dust [part of machines]

source: Industrielle Manipulatoren [Maschinen]
en: Handling machines, automatic [manipulators]

source: Turbinen, ausgenommen für Landfahrzeuge
en: Turbines, other than for land vehicles

source: Elektronische Türschließsysteme
en: Electronic door closing system

source: Pleuelstangen für Maschinen und Motoren
en: Connecting rods for machines, motors and engines

source: Kugellager
en: Ball-bearings

source: Garbenbinder [Maschinen]
en: Sheaf-binding machines

source: Hornmaschine zur Metallbearbeitung
en: Horning machines [for metalworking]

source: Platten zum Sintern von Keramikmaterial
en: Plates for the sintering of ceramic materials

source: Abzweigrohre aus Metall [Teile von Motoren]
en: Metal branching pipes [parts of engines]

source: Metallschneidewerkzeuge [Maschinen]
en: Metal cutting tools [machines]

source: Gefederte Führungsschienen [Maschinenteile]
en: Sprung guide rails [parts of machines]

source: Luftkompressoren für Druckluftsysteme in Fahrzeugen
en: Air compressors for vehicle compressed air systems

source: Luftfilter für Motorradmotoren
en: Air filters for motorcycle engines

source: Elektroden für Schweißgeräte
en: Electrodes for welding machines

source: Bürsten als Teile von Generatoren
en: Brushes being parts of generators

source: Schaufeln für Erdbewegungsmaschinen
en: Buckets for earth moving machines

source: Drehtische für Werkzeugmaschinen
en: Rotary tables for machine tools

source: Maschinen zum Sieben
en: Screening machines

source: Elektrische Fensteröffner
en: Window openers, electric

source: Längsschneider [Maschinen]
en: Longitudinal cutters [machines]

source: Schwimmende oder nicht schwimmende Bohrtürme
en: Drilling rigs, floating or non-floating

source: Brennstoffumwandler für Verbrennungsmotoren
en: Fuel conversion apparatus for internal combustion engines

source: Schneidbrenner
en: Cutting torches

source: Crimpzangen [Maschinen oder Maschinenteile]
en: Crimping tools [machines or parts of machines]

source: Messer für Fräsmaschinen
en: Cutters for milling machines

source: Glühkerzen für Dieselmotoren
en: Glow plugs for Diesel engines

source: Elektrische Schärfmaschinen für Werkzeuge
en: Sharpening machines for tools (Electric -)

source: Schleifscheiben [elektrische Maschinen]
en: Sharpening wheels [electric machines]

source: Blechabscheider [Maschinen]
en: Sheet metal separators [machines]

source: Stoßdämpfungszylinder [Maschinenteile]
en: Shock absorbing cylinders [parts of machines]

source: Motorbetriebene Zugangsarbeitsbühnen
en: Powered access work platforms

source: Halbleiterbearbeitungsmaschinen zum Beizen von Halbleiterscheiben
en: Semiconductor processing machines for etching semiconductor wafers

source: Halbleiterbearbeitungsmaschinen zum Beizen von Trägermaterial
en: Semiconductor processing machines for etching substrates

source: Halbleiterbearbeitungsmaschinen zur Herstellung von Trägermaterial
en: Semiconductor processing machines for the manufacture of substrates

source: Abscheider für flüssige Lösungen
en: Separators for liquid solutions

source: Elektromotoren für Maschinen mit einer digitalen Servoantriebssteuerung
en: Electric motors for machines with a digital servo drive controller

source: Pneumatische Einspritzdüsen für Motoren
en: Pneumatic fuel injectors for engines

source: Elektrische Polierapparate und -maschinen für Haushaltszwecke
en: Polishing (machines and apparatus for -) for household purposes [electric]

source: Hefter [ausgenommen für chirurgische oder Bürozwecke]
en: Stapling presses [other than for surgical or stationery use]

source: Steuergeräte für Maschinen oder Motoren
en: Control mechanisms for machines, engines or motors

source: Pneumatische Scheren
en: Pneumatic shears

source: Schubstangen [Teile von Fahrzeugmotoren]
en: Push rods [vehicle engine parts]

source: Kipphebel [Teile von Fahrzeugmotoren]
en: Rocker arms [vehicle engine parts]

source: Elektronische Türöffner
en: Electronic door openers

source: Gestelle für Maschinen
en: Hangers [parts of machines]

source: Strickspulen [Maschinenteile]
en: Knitting bobbins [parts of machines]

source: Zementmischer für die Zementierung von Schächten
en: Cement mixers for the cementation of wells

source: Hebewinden [ausgenommen handbetätigte]
en: Lifting jacks [other than hand-operated]

source: Hebezangen für Kräne
en: Lifting tongs for cranes

source: Linearaktoren [mechanische]
en: Linear actuators [mechanical]

source: Kreissägen als transportable Elektrowerkzeuge
en: Circular saws being portable electric power tools

source: Nicht handbetätigte landwirtschaftliche Geräte
en: Agricultural implements, other than hand-operated

source: Schleifscheiben [Maschinenteile]
en: Grindstones [parts of machines]

source: Fleischwölfe [elektrische Maschinen] für Haushaltszwecke
en: Meat mincing machines [electric machines] for household use

source: Spannpatronen als Maschinenteile
en: Collets being parts of machines

source: Kombinierte Behälter und Mischer für die Betonherstellung
en: Combined skips and mixers for producing concrete

source: Schneidwerkzeuge für maschinelle Anlagen
en: Cutting tools for machine centres

source: Differentialgetriebe für Luftfahrzeuge
en: Differential gear mechanisms for air vehicles

source: Hobelwerkzeuge [Maschinenteile]
en: Planing tools [parts of machines]

source: Kunststoffrohre [angepasste Maschinenteile]
en: Plastics pipes [fitted parts of machines]

source: Rohrentgrater [Maschinen]
en: Tube reamers [machines]

source: Kettenschaltungen, ausgenommen für Landfahrzeuge
en: Tumbler gears, other than for land vehicles

source: Entkerner für Gemüse [Maschinen]
en: Vegetable corers [machines]

source: Gemüseschäler [Maschinen]
en: Vegetable peelers [machines]

source: Elektrische Bohnermaschinen für industrielle Zwecke
en: Electric wax-polishing machines for industrial purposes

source: Abscheider für schwere Medien [Maschinen]
en: Heavy media separators [machines]

source: Schrägverzahnte Zahnräder als Maschinenteile
en: Helical gear units being parts of machines

source: Hydraulikventile
en: Hydraulic valves

source: Hydraulisch angetriebene Winden für die Schifffahrt
en: Hydraulically driven winches for marine use

source: Riemenscheiben
en: Belt pulleys

source: Elektrische Zündspulen
en: Electric ignition coils

source: Elektromotoren, ausgenommen für Landfahrzeuge
en: Motors, electric, other than for land vehicles

source: Auflösungsmaschinen für chemische Verfahren
en: Dissolving machines [for chemical processing]

source: Scheibeneggen [traktorgezogene landwirtschaftliche Geräte]
en: Disc harrows [tractor towed agricultural implements]

source: Pendelschutzbremsen für Greifer
en: Anti-swinging brakes for grippers

source: Erschütterungsfreie Ständer für Maschinen
en: Anti-vibration mountings for machines

source: Gelenkgetriebe für Luftfahrzeuge
en: Articulated transmissions for aircraft

source: Scheibensiebe [Maschinenteile]
en: Disc screens [parts of machines]

source: Schaltgetriebe
en: Speed changers

source: Spindelwinden [Teile von Motoren]
en: Spindle shafts [parts of engines]

source: Kolben für Fahrzeugmotoren
en: Pistons for vehicle engines

source: Treibriemen für Motoren
en: Belts for motors and engines

source: Siegelmaschinen für gewerbliche Zwecke
en: Sealing machines for industrial purposes

source: Schraubmaschinen mit Eigenantrieb
en: Self-driven machines for screwing

source: Selbstangetriebene Kräne
en: Self-propelled cranes

source: Selbstfahrende Arbeitskörbe
en: Self-propelled working baskets

source: Selbstregulierende Pumpen [ausgenommen zur Abgabe von Brennstoffen an Tankstellen]
en: Self-regulating pumps [other than for the delivery of fuel at filling stations]

source: Halbautomatische Umreifungsmaschinen
en: Semi-automatic strapping machines

source: Stopfbüchsen [Maschinenteile]
en: Stuffing boxes [parts of machines]

source: Tischschleifer [Maschinen]
en: Bench grinders [machines]

source: Numerisch gesteuerte Gewindeschneidmaschinen mit Koordinatentischen
en: Numerically controlled tapping machines with co-ordinate tables

source: Maschinen zur Reproduktion von Bildern
en: Image reproduction machines [printing]

source: Elektrische Wechselstrommotorantriebe
en: Electric alternating current motor drives

source: Anlasser für stationäre Motoren
en: Starters for stationary engines

source: Torsionswellen für Maschinen
en: Torsion bars for machines

source: Torsionsdämpfer für Maschinen
en: Torsion dampers for machines

source: Maschinen zur Bearbeitung von Gegenständen mit Hilfe von Bearbeitungsflüssigkeiten
en: Processing machines using processing liquids for the treatment of objects

source: Progressive Anlasser für Asynchronmotoren
en: Progressive starters for asynchronous motors
